Вообщем. Делаю игру-стратегию. Для Вк. Хочется отразить экономику и население. 
План:
# 1. Добавление информационных команд +
# 2. Смена ника +
# 3. Добавление фото профиля +
# 4. Добавление описания профиля +
# 3. Добавление работы с феодом { постройка зданий, рост населения +, улучшение зданий, работа зданий, создание глобального рынка, потребление населения, создание армии }
# 4. Костомизация профиля
# 5. Добавление карты с провинциями, ресурсами, ростом населения
# 6. Добавление возможности просмотреть карту, захвата провинций
# 7. Поработать с гильдиями

Так же хотел бы для себя самого обозначить контекст, окружение игры. Это будет некоторое средневековье, с феодалами, домами, рабством. Однако, вместе с тем,
в этом мире существуют паровые машины, поезда, стрелковое оружие, корабли и так далее. Карта мира - Европа, сейчас можно взять только Францию. На карте должна распологаться
часть римской империи, не павшей, но очень сильно пострадавшей. Она в основном населена немецкоговорящими жителями, владеют Севером Италии, двумя провинциями во
Франции. Во Франции существует Бретонская Канцелярия. Регион из которого 100 лет назад начался завоевательный поход Рудольфа Бретонского. Он был философом, математиком,
много времени уделил тому, чтобы развить экономически, и научно, свой регион. На базе своего отца ему удалось сделать множество открытый, в том числе создать
наиболее хорошие на тот момент орудия стрельбы, артиллерию, поезда. Это развитие также помогло ему собрать хорошо обученную армию, с отличными генералами. Бретонское
Германское воинство пошло вперед. Рудольф лично вел его. Катком прошелся он по Французским землям, Итальянским, Немецким и так далее. В оснвном там были разрозненные
княжества и очень слабая централизации. Некоторые народы он вырезал. Он покорил Римскую Империю и Восточно-Прусское Королевство. На всех землях он создавал администрации,
комиссариаты, префектуры, города-государства, гауляйтерства, королевства и княжества. Свою войну он закончил на т.н. "Восточном Вале", где погиб в сражении.
Уже при его жизни захваченные земли начали калопсировать, очень много движений за независимость и прочего. В 5 году от смерти Рудольфа Бретонского, Рим поднял восстание,
началась кровавая война подавления. Наместники из окружных территорий помогали ему, но очень слабо. Орден Сохранения, правящий Империей Рудольфа, не смог принять
правильных решений. В тылах начали появляться недовольные, загорелась Прибалтика, Северные земли, Германия. Империя Рудольфа с боями отступала к Бретони. 
Регион Бретони также обезлюдил, развалился на несколько отдельных княжеств и одну аристократическую республику. На территории Эльзас-Лотаргинии закрепился
Черный Орден, распространяющий ариохристианскую веру, и тотальное обновление устоев. 
